; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype microwavetype fridgetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   carttype drawertype shelftype stoveburnertype bedtype coffeemachinetype - receptacletype
   ladletype clothtype plungertype cuptype pillowtype pantype tennisrackettype pottype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 location6 location7 location8 - location
   cart_1 cart_2 drawer_3 shelf_4 shelf_5 stoveburner_6 bed_7 coffeemachine_8 microwave_9 fridge_10 - receptacle
   ladle_1 cloth_2 plunger_3 cup_4 pillow_5 pan_6 tennisracket_7 pot_8 - obj
 )
 (:init (receptacletype_0 cart_1 carttype) (receptacletype_0 cart_2 carttype) (receptacletype_0 drawer_3 drawertype) (receptacletype_0 shelf_4 shelftype) (receptacletype_0 shelf_5 shelftype) (receptacletype_0 stoveburner_6 stoveburnertype) (receptacletype_0 bed_7 bedtype) (receptacletype_0 coffeemachine_8 coffeemachinetype) (receptacletype_0 microwave_9 microwavetype) (receptacletype_0 fridge_10 fridgetype) (objecttype_0 ladle_1 ladletype) (objecttype_0 cloth_2 clothtype) (objecttype_0 plunger_3 plungertype) (objecttype_0 cup_4 cuptype) (objecttype_0 pillow_5 pillowtype) (objecttype_0 pan_6 pantype) (objecttype_0 tennisracket_7 tennisrackettype) (objecttype_0 pot_8 pottype) (cancontain carttype clothtype) (cancontain carttype plungertype) (cancontain drawertype ladletype) (cancontain drawertype clothtype) (cancontain shelftype clothtype) (cancontain shelftype cuptype) (cancontain shelftype pottype) (cancontain stoveburnertype pantype) (cancontain stoveburnertype pottype) (cancontain bedtype pillowtype) (cancontain bedtype tennisrackettype) (cancontain microwavetype cuptype) (cancontain fridgetype cuptype) (cancontain fridgetype pantype) (cancontain fridgetype pottype) (pickupable ladle_1) (cleanable ladle_1) (pickupable cloth_2) (cleanable cloth_2) (pickupable plunger_3) (pickupable cup_4) (isreceptacleobject cup_4) (cleanable cup_4) (heatable cup_4) (coolable cup_4) (pickupable pillow_5) (pickupable pan_6) (isreceptacleobject pan_6) (cleanable pan_6) (coolable pan_6) (pickupable tennisracket_7) (pickupable pot_8) (isreceptacleobject pot_8) (cleanable pot_8) (coolable pot_8) (receptacleatlocation cart_1 location6) (receptacleatlocation cart_2 location8) (receptacleatlocation drawer_3 location5) (receptacleatlocation shelf_4 location1) (receptacleatlocation shelf_5 location1) (receptacleatlocation stoveburner_6 location6) (receptacleatlocation bed_7 location8) (receptacleatlocation coffeemachine_8 location6) (receptacleatlocation microwave_9 location7) (receptacleatlocation fridge_10 location7) (inreceptacle ladle_1 drawer_3) (inreceptacle cloth_2 drawer_3) (inreceptacle plunger_3 cart_1) (inreceptacle cup_4 microwave_9) (inreceptacle pillow_5 bed_7) (inreceptacle pan_6 stoveburner_6) (inreceptacle tennisracket_7 bed_7) (inreceptacle pot_8 shelf_4) (objectatlocation ladle_1 location5) (objectatlocation cloth_2 location5) (objectatlocation plunger_3 location6) (objectatlocation cup_4 location7) (objectatlocation pillow_5 location8) (objectatlocation pan_6 location6) (objectatlocation tennisracket_7 location8) (objectatlocation pot_8 location1) (atlocation agent1 location8) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o - obj)
 (and (coolable ?o) (objecttype_0 ?o cuptype) (receptacletype_0 ?r fridgetype) (iscool ?o) (inreceptacle ?o ?r))))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location8 location7)
   deleted: (atlocation agent1 location8)
   added: (atlocation agent1 location7)
   goals met: 0 of 1
2. (pickupobject agent1 location7 cup_4 microwave_9)
   deleted: (inreceptacle cup_4 microwave_9) (objectatlocation cup_4 location7)
   added: (holds agent1 cup_4) (holdsany agent1)
   goals met: 0 of 1
3. (coolobject agent1 location7 fridge_10 cup_4)
   added: (iscool cup_4)
   goals met: 0 of 1
4. (putobject agent1 location7 cup_4 fridge_10 cuptype fridgetype)
   deleted: (holds agent1 cup_4) (holdsany agent1)
   added: (inreceptacle cup_4 fridge_10) (objectatlocation cup_4 location7)
   goals met: 1 of 1
